{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "data"}, "name": "data", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "bn_data", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_data", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv0", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling0", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling0", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit1_bn1", "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit1_relu1", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_2", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_conv1", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit1_bn2", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit1_relu2", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_3", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_conv2", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_sc", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_sc", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit2_bn1", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit2_relu1", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_4", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit2_conv1", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit2_bn2", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit2_relu2", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_5", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit2_conv2", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit1_bn1", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit1_relu1", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_6", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_conv1", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit1_bn2", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit1_relu2", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_7", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_conv2", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_sc", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_sc", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit2_bn1", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit2_relu1", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_8", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit2_conv1", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit2_bn2", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit2_relu2", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_9", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit2_conv2", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit1_bn1", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit1_relu1", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_10", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_conv1", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit1_bn2", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit1_relu2", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_11", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_conv2", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_sc", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_sc", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit2_bn1", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit2_relu1", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_12", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit2_conv1", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit2_bn2", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit2_relu2", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_13", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit2_conv2", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit1_bn1", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit1_relu1", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_14", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit1_conv1", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit1_bn2", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit1_relu2", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_15", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit1_conv2", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit1_sc", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit1_sc", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit2_bn1", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit2_relu1", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_16", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit2_conv1", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit2_bn2", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit2_relu2", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_17", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit2_conv2", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc1", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "softmax", "inbound_nodes": [[["fc1", 0, 0, {}]]]}], "input_layers": [["data", 0, 0]], "output_layers": [["softmax", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}